# Напишите программу для вывода на экран чисел от 0 до 100

for i in range(101):
    print(i, end=' ')
